[
  {
    "issue": 2419,
    "branch": "feat/task0-generator-sdk-flag",
    "description": "Add --sdk flag to generator (PREREQUISITE)",
    "task": "Update amplihack new command to support --sdk flag with choices [copilot, claude, microsoft, mini]. Default to 'copilot'. Changes needed: 1) Add --sdk option to cli.py with click.option, 2) Update agent_assembler.py to accept sdk parameter and use it instead of hardcoded 'claude', 3) Add tests. This MUST complete before SDK implementations can proceed.",
    "recipe": "default-workflow"
  },
  {
    "issue": 2415,
    "branch": "feat/pr-b-claude-sdk",
    "description": "Claude Agent SDK Implementation",
    "task": "Full integration with claude-agents package in sdk_adapters/claude_sdk.py. Use /claude-agent-sdk skill for API reference. Implement: native tools (bash, read/write/edit, glob, grep), subagent support for teaching, MCP integration, 7 learning tools mapping, unit tests, L1-L12 eval (3-run parallel), quality audit, self-improvement loop (5 iterations). Must score within 10% of mini-framework baseline. Reference: /home/azureuser/src/amplihack5/src/amplihack/agents/goal_seeking/learning_agent.py for baseline implementation.",
    "recipe": "default-workflow"
  },
  {
    "issue": 2416,
    "branch": "feat/pr-c-copilot-sdk",
    "description": "GitHub Copilot SDK Implementation (DEFAULT)",
    "task": "Full integration with github-copilot-sdk package in sdk_adapters/copilot_sdk.py. Use /github-copilot-sdk skill for API reference. Implement: native tools (file system, git, web --allow-all mode), session-based state management, 7 learning tools mapping, unit tests, L1-L12 eval (3-run parallel), quality audit, self-improvement loop (5 iterations). Update generator default to use this SDK. Must score within 10% of mini-framework baseline.",
    "recipe": "default-workflow"
  },
  {
    "issue": 2417,
    "branch": "feat/pr-d-microsoft-sdk",
    "description": "Microsoft Agent Framework Implementation",
    "task": "Full integration with agent-framework package in sdk_adapters/microsoft_sdk.py. Use /microsoft-agent-framework skill for API reference. Implement: Thread state + @function_tool decorator + GraphWorkflow, middleware + telemetry integration, 7 learning tools mapping, unit tests, L1-L12 eval (3-run parallel), quality audit, self-improvement loop (5 iterations). Must score within 10% of mini-framework baseline.",
    "recipe": "default-workflow"
  },
  {
    "issue": 2418,
    "branch": "feat/pr-e-self-improving-skill",
    "description": "Self-Improving Agent Builder Skill",
    "task": "Create .claude/skills/self-improving-agent-builder/ with reusable workflow: build → eval → audit → improve → re-eval. Use subprocess sub-agents for each phase. Must work with all 4 implementations (mini-framework + 3 SDKs). Configurable iteration limit (default 5). Logs progress and scores. Reverts unsuccessful improvements. Includes documentation, examples, and integration tests.",
    "recipe": "default-workflow"
  }
]
